Revit 2027 API
IntersectingElementData Properties
The IntersectingElementData type exposes the following members.
Properties
Name | Description
IntersectedElementId |  Id of the intersected element.
IntersectingElementId |  Id of the intersecting element.
IntersectionType |  The intersection type.
IntersectionVolume |  The intersection volume.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
IntersectingElementData Class
Autodesk.Revit.DB Namespace